{"id": "c652bbb3-e6e2-4bda-bfef-b3727e14dafb", "name": "SIGMA - Suspicious MSI Execution Spawning Consent", "enabled": true, "throttle": "no_actions", "interval": "1m", "author": ["Onni Knuutila"], "description": "Detects suspicious MSI execution originating from user download locations that spawns consent.exe, consistent with loader behavior observed in malware campaigns.", "rule_id": "c652bbb3-e6e2-4bda-bfef-b3727e14dafb", "false_positives": ["Unknown"], "from": "now-2m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "risk_score_mapping": [], "severity": "high", "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "reference": "https://attack.mitre.org/techniques/T1218", "name": "System Binary Proxy Execution", "subtechnique": [{"id": "T1218.007", "reference": "https://attack.mitre.org/techniques/T1218/007", "name": "Msiexec"}]}]}], "tags": [], "to": "now", "references": ["https://thedfirreport.com/2025/08/05/from-bing-search-to-ransomware-bumblebee-and-adaptixc2-deliver-akira/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "query", "language": "lucene", "index": ["logs-*"], "query": "(process.executable:*.msi AND (process.command_line:(*C\\:\\\\Users\\* OR *\\\\Downloads\\*))) AND (process.parent.executable:*.msi AND process.executable:*consent.exe)", "filters": [], "actions": []}
{"id": "1cdd9a09-06c9-4769-99ff-626e2b3991b8", "name": "SIGMA - Suspicious Double Extension File Execution", "enabled": true, "throttle": "no_actions", "interval": "1m", "author": ["Florian Roth (Nextron Systems), @blu3_team (idea), Nasreddine Bencherchali (Nextron Systems)"], "description": "Detects suspicious use of an .exe extension after a non-executable file extension like .pdf.exe, a set of spaces or underlines to cloak the executable file in spear phishing campaigns", "rule_id": "1cdd9a09-06c9-4769-99ff-626e2b3991b8", "false_positives": ["Unknown"], "from": "now-2m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 99, "risk_score_mapping": [], "severity": "critical", "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1566", "reference": "https://attack.mitre.org/techniques/T1566", "name": "Phishing", "subtechnique": [{"id": "T1566.001", "reference": "https://attack.mitre.org/techniques/T1566/001", "name": "Spearphishing Attachment"}]}]}], "tags": [], "to": "now", "references": ["https://blu3-team.blogspot.com/2019/06/misleading-extensions-xlsexe-docexe.html", "https://twitter.com/blackorbird/status/1140519090961825792"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "query", "language": "lucene", "index": ["logs-*"], "query": "(process.executable:(*.doc.exe OR *.docx.exe OR *.xls.exe OR *.xlsx.exe OR *.ppt.exe OR *.pptx.exe OR *.rtf.exe OR *.pdf.exe OR *.txt.exe OR *\\ \\ \\ \\ \\ \\ .exe OR *______.exe OR *.doc.js OR *.docx.js OR *.xls.js OR *.xlsx.js OR *.ppt.js OR *.pptx.js OR *.rtf.js OR *.pdf.js OR *.txt.js)) AND (process.command_line:(*.doc.exe* OR *.docx.exe* OR *.xls.exe* OR *.xlsx.exe* OR *.ppt.exe* OR *.pptx.exe* OR *.rtf.exe* OR *.pdf.exe* OR *.txt.exe* OR *\\ \\ \\ \\ \\ \\ .exe* OR *______.exe* OR *.doc.js* OR *.docx.js* OR *.xls.js* OR *.xlsx.js* OR *.ppt.js* OR *.pptx.js* OR *.rtf.js* OR *.pdf.js* OR *.txt.js*))", "filters": [], "actions": []}
{"id": "867356ee-9352-41c9-a8f2-1be690d78216", "name": "SIGMA - Potentially Suspicious Regsvr32 HTTP/FTP Pattern", "enabled": true, "throttle": "no_actions", "interval": "1m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects regsvr32 execution to download/install/register new DLLs that are hosted on Web or FTP servers.", "rule_id": "867356ee-9352-41c9-a8f2-1be690d78216", "false_positives": ["Unknown"], "from": "now-2m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "risk_score_mapping": [], "severity": "medium", "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "reference": "https://attack.mitre.org/techniques/T1218", "name": "System Binary Proxy Execution", "subtechnique": [{"id": "T1218.010", "reference": "https://attack.mitre.org/techniques/T1218/010", "name": "Regsvr32"}]}]}], "tags": [], "to": "now", "references": ["https://twitter.com/mrd0x/status/1461041276514623491", "https://twitter.com/tccontre18/status/1480950986650832903", "https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "query", "language": "lucene", "index": ["logs-*"], "query": "(process.executable:*\\\\regsvr32.exe OR process.pe.original_file_name:REGSVR32.EXE) AND (process.command_line:(*\\ \\/i* OR *\\ \\-i*)) AND (process.command_line:(*ftp* OR *http*))", "filters": [], "actions": []}
{"id": "a7a2de9e-9baa-483d-a600-d095ff6d6f03", "name": "SIGMA - Rundll32 COMSVCS LSASS Dump", "enabled": true, "throttle": "no_actions", "interval": "1m", "author": ["Onni Knuutila"], "description": "Detects potential LSASS memory dumps using rundll32.exe and comsvcs.dll.", "rule_id": "a7a2de9e-9baa-483d-a600-d095ff6d6f03", "false_positives": ["Unknown"], "from": "now-2m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "risk_score_mapping": [], "severity": "high", "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": [], "to": "now", "references": ["https://thedfirreport.com/2025/08/05/from-bing-search-to-ransomware-bumblebee-and-adaptixc2-deliver-akira/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "query", "language": "lucene", "index": ["logs-*"], "query": "process.executable:*rundll32.exe AND process.command_line:*comsvcs.dll* AND process.command_line:*MiniDump*", "filters": [], "actions": []}
{"id": "5afee48e-67dd-4e03-a783-f74259dcf998", "name": "SIGMA - Potential LSASS Process Dump Via Procdump", "enabled": true, "throttle": "no_actions", "interval": "1m", "author": ["Florian Roth (Nextron Systems)"], "description": "Detects suspicious uses of the SysInternals Procdump utility by using a special command line parameter in combination with the lsass.exe process.\nThis way we are also able to catch cases in which the attacker has renamed the procdump executable.\n", "rule_id": "5afee48e-67dd-4e03-a783-f74259dcf998", "false_positives": ["Unlikely, because no one should dump an lsass process memory", "Another tool that uses command line flags similar to ProcDump"], "from": "now-2m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "risk_score_mapping": [], "severity": "high", "severity_mapping": [], "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "reference": "https://attack.mitre.org/techniques/T1036", "name": "Masquerading", "subtechnique": []}]}, {"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "reference": "https://attack.mitre.org/techniques/T1003", "name": "OS Credential Dumping", "subtechnique": [{"id": "T1003.001", "reference": "https://attack.mitre.org/techniques/T1003/001", "name": "LSASS Memory"}]}]}], "tags": ["car-2013-05-009"], "to": "now", "references": ["https://learn.microsoft.com/en-us/sysinternals/downloads/procdump"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "query", "language": "lucene", "index": ["logs-*"], "query": "process.command_line:(*\\ \\-ma\\ * OR *\\ \\/ma\\ * OR *\\ \u2013ma\\ * OR *\\ \u2014ma\\ * OR *\\ \u2015ma\\ *) AND process.command_line:*\\ ls*", "filters": [], "actions": []}
{"id": "17f6f3be-824a-4f8d-a4ec-61fe2fd0c021", "name": "SIGMA - Suspicious Rundll32 Execution", "enabled": true, "throttle": "no_actions", "interval": "1m", "author": ["Onni Knuutila"], "description": "Detects suspicious use of rundll32 to execute scriptlets, remote URLs or non-standard payloads.", "rule_id": "17f6f3be-824a-4f8d-a4ec-61fe2fd0c021", "false_positives": ["Some installers or setup tools may legitimately call rundll32 with exported functions", "Certain applications may load DLLs from AppData or Temp during normal operation", "Legacy Windows features may use script components (scrobj.dll, vbscript, javascript)", "Occasional administrative tasks may trigger similar behavior"], "from": "now-2m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "risk_score_mapping": [], "severity": "medium", "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "reference": "https://attack.mitre.org/techniques/T1218", "name": "System Binary Proxy Execution", "subtechnique": []}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense-Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "reference": "https://attack.mitre.org/techniques/T1218", "name": "System Binary Proxy Execution", "subtechnique": [{"id": "T1218.011", "reference": "https://attack.mitre.org/techniques/T1218/011", "name": "Rundll32"}]}]}], "tags": [], "to": "now", "references": ["https://lolbas-project.github.io/lolbas/Binaries/Rundll32/", "https://lolbas-project.github.io/lolbas/Libraries/Scrobj/"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "query", "language": "lucene", "index": ["logs-*"], "query": "process.executable:*\\\\rundll32.exe AND ((process.command_line:(*javascript\\:* OR *vbscript\\:* OR *scrobj.dll* OR *.sct* OR *http\\:\\/\\/* OR *https\\:\\/\\/* OR *ShellExecute* OR *DllRegisterServer*)) OR (process.command_line:(*\\\\AppData\\* OR *\\\\Temp\\*)))", "filters": [], "actions": []}
