title: Suspicious Use of find - GTFOBins
id: 93156e8a-fecf-4454-9e38-87942a122e8e
status: experimental
description: Detects the use of find to spawn system shells or write files to the system.
references:
    - https://gtfobins.github.io/gtfobins/find/
author: <your name>
date: <today's date>
tags:
    - attack.privilege_escalation
    - attack.t1059
    - attack.execution
logsource:
    product: linux
    category: process_creation
detection:
    bin:
        Image|endswith: '/find'
    cmdline_shell:
        CommandLine|contains: '-exec'
    cmdline_write:
        CommandLine|contains: '-fprintf'
    cmdline_bin:
        CommandLine|contains:
            - '/bin/sh'
            - '/bin/bash'
            - '/bin/zsh'
            - '/bin/fish'
            - '/bin/ksh'
            - '/bin/dash'
            - '/bin/tcsh'
            - '/bin/mksh'
            - '/bin/yash'
            - '/bin/xonsh'
    cmdline_sensitive:
        CommandLine|contains:
            - 'passwd'
            - 'shadow'
            - 'sudoers'
            - 'sshd_config'
            - 'authorized_keys'
            - 'hosts'
            - 'crontab'
    condition: bin and ((cmdline_shell and cmdline_bin) or (cmdline_write and cmdline_sensitive))
falsepositives:
    - Administrative or user activity; unlikely
level: high