title: Suspicious Awk Shell Spawn
id: 85379e2e-8981-4f10-be5a-b64219da3f97
status: experimental
description: Detects suspicious use of awk/gawk/mawk/nawk to spawn an interactive shell via system() from the command line.
references:
    - https://gtfobins.github.io/gtfobins/awk/
    - https://gtfobins.github.io/gtfobins/gawk/
    - https://gtfobins.github.io/gtfobins/mawk/
    - https://gtfobins.github.io/gtfobins/nawk/
author: Onni Knuutila
date: 2025-12-10
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1059.004 # Command and Scripting Interpreter: Unix Shell
    - attack.t1202 # Indirect Command Execution
logsource:
    product: linux
    category: process_creation
detection:
    selection_img:
        Image|endswith:
            - 'awk'
            - 'gawk'
            - 'mawk'
            - 'nawk'
    selection_shell:
        CommandLine|contains:
            - 'system("/bin/sh")'
            - 'system("/bin/bash")'
    condition: selection_img and selection_shell
falsepositives:
    - Unknown
level: high