title: Akira Encrypted File Creation
id: 1a4f6e2c-8c2d-4b9a-9d4e-3f6b2a1c9e01
status: experimental
description: Detects creation of files with extensions commonly used by Akira.
references:
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-109a
author: Onni Knuutila
date: 2025-12-17
tags:
    - attack.impact
    - attack.t1486
logsource:
    product: windows
    category: file_create
detection:
    selection_ext:
        TargetFilename|endswith: 
            - '.akira'
            - '.powerranges'
            - '.akiranew'
            - '.aki'
    condition: selection_ext
falsepositives:
    - Unlikely
level: high
