title: WinRAR Password-Protected Archiving
id: 0f1e2d3c-4b5a-6978-8c9d-0e1f2a3b4c5e
status: experimental
description: Detects WinRAR creating archives with password protection, which is could used to stage data for exfiltration.
references:
    - https://attack.mitre.org/techniques/T1560/001/
author: Onni Knuutila
date: 2025-12-17
tags:
    - attack.collection
    - attack.t1560.001
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        Image|endswith:
            - '\winrar.exe'
            - '\rar.exe'
    selection_cmd:
        CommandLine|contains:
            - ' a '
            - '-p'
            - '-hp'
    condition: selection_img and selection_cmd
falsepositives:
    - Legitimate use of WinRAR to protect sensitive archives.
level: medium
