title: Potential Data Exfiltration via Rclone over FTP
id: 9b2f1b64-9b7b-4c6a-9a3e-6f2c2b4f0a19
status: experimental
description: Detects potential data exfiltration over FTP using rclone invoked via PowerShell.
author: Onni Knuutila
date: 2025-12-16
tags:
    - attack.exfiltration
    - attack.t1048.003
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        Image|endswith: '\powershell.exe'
    selection_rclone_reference:
        CommandLine|contains: 'rclone.exe'
    selection_ftp_activity:
        CommandLine|contains|all:
            - 'config'
            - 'create'
            - 'ftp'
    selection_rclone_transfer:
        CommandLine|contains:
            - ' copy '
            - 'copyto'
            - 'sync'
    selection_ftp_flags:
        CommandLine|contains: '--ftp-'
    selection_staging_paths:
        CommandLine|contains:
            - 'C:\Users\Public\Downloads\'
            - 'C:\Windows\temp\'
            - 'C:\Users\Public\'
            - 'C:\ProgramData\'
    condition: selection_img and selection_rclone_reference and selection_staging_paths and (selection_ftp_activity or (selection_rclone_transfer and selection_ftp_flags))
falsepositives:
    - Legitimate PowerShell automation invoking rclone for FTP-based transfers
level: medium
