title: Suspicious MSI Execution Spawning Consent
id: c652bbb3-e6e2-4bda-bfef-b3727e14dafb
status: experimental
description: Detects suspicious MSI execution originating from user download locations that spawns consent.exe, consistent with loader behavior observed in malware campaigns.
references:
    - https://thedfirreport.com/2025/08/05/from-bing-search-to-ransomware-bumblebee-and-adaptixc2-deliver-akira/
author: Onni Knuutila
date: 2025-12-10
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1218.007 # System Binary Proxy Execution (msiexec)
logsource:
    product: windows
    category: process_creation
detection:
    selection_msi_from_downloads:
        Image|endswith: '.msi'
        CommandLine|contains:
            - 'C:\\Users\\'
            - '\\Downloads\\'
    selection_child_consent:
        ParentImage|endswith: '.msi'
        Image|endswith: 'consent.exe'
    condition: selection_msi_from_downloads and selection_child_consent
falsepositives:
    - Unknown
level: high